"""
str字面值
"""

#单引号内的双引号不算结束符
message = '我叫"苏大强".'

#双引号内的单引号不算结束符
message = "我叫'苏大强'."

#转义符：＼" \n
message = "我叫\"苏大强\"."  #加条杠
message = "我叫\n苏大强."  #换行符
message = "我叫\t苏大强."  #水平制表格　tab键

#原始字符串r（没有转义符）
url = r"C:\ProgramData\Apple\Installer Cache"  #如果这是路径，但电脑会以为是转义符．在最前面加r
print(url)

#字符串格式化
a = "1"
b = "2"

#在字符串中插入变量
#请输入1+2＝？
#字符串的拼接（缺点：乱）
str01 = "请输入" +a + "+" +b + "=?"

str02 = "请输入%s+%s=? " %(a,b)  #%s整型
print(str01)
print(str02)
str03 = "请输入%s+%.1f=?" %(1,10.5) #%f浮点型，显示出来时，小数点后面跟很多０
                                #可以用％．１（保留几位小数）f
print(str03)