"""
存储全国各个城市的景区与美食(不用录入),在控制台中显示出来.
  　北京：
        景区：故宫,天安门,天坛.
        美食: 烤鸭,炸酱面,豆汁,卤煮.
    四川:
        景区：九寨沟,峨眉山,春熙路．
        美食: 火锅,串串香,兔头

"""
dict1 = {
    "北京":                                   #字符串在容器里要加双引号
        {
            "景区":["故宫","天安门","天坛"],      #每对键值之间要用逗号隔开
        "美食": ["烤鸭","炸酱面","豆汁","卤煮"]},
    "四川":
        {
            "景区":["九寨沟","峨眉山","春熙路"],
        "美食": ["火锅","串串香","兔头"]}
}

#需求：　获取四川的所有美食

for item in dict1["四川"]["美食"]:   #遍历打印每个
    print(item)
# 或
print(dict1["四川"]["美食"])
#获取所有城市

for key in dict1:  #观察城市所在的位置，打印键
    print(key)


# 需求：所有城市的景区
print(dict1["四川"]["景区"])
print(dict1["北京"]["景区"])
# print(dict1["xxx"]["景区"])

list02 = []
# 遍历大字典，获取的是地区
for key in dict1:
    # 遍历景区列表
    for item in dict1[key]["景区"]:
        # 地区+景区
        list02.append(key + ":" + item)

print(list02)


