"""
总结：
 　　存储多个学生信息(姓名,年龄,成绩,性别)的多种方式

1. exercise05字典内嵌列表:
{
    "张无忌":[28,100,"男"],
}
2. exercise06字典内嵌字典:
{
    "张无忌":{"age":28,"score":100,"sex":"男"},
}
3. exercise07列表内嵌字典:
[
    {"name":"张无忌","age":28,"score":100,"sex":"男"},
]
4. 列表内嵌列表
[
    ["张无忌",28,100男],
]
选择策略：根据具体需求，结合优缺点，综合考虑(两害相权取其轻).
    字典：
        优点：根据键获取值，读取速度快；
        　　　代码可读性相对列表更高(根据键获取与根据索引获取).
        缺点：内存占用大；
        　　　获取值只能根据键,不灵活.
    列表：
        优点：根据索引/切片，获取元素更灵活.
             相比字典占内存更小。
        缺点：通过索引获取，如果信息较多，可读性不高.
"""
dict01 = {}
while True:
    name = input("请输入商品名称：")
    if name =="":
        break
    price = int(input("请输入商品单价："))
    dict01[name] = price

for key, value in dict01.items():
    print("%s商品单价是%d"%(key,value))















